# 3.1 Сценарій: Необхідно запланувати регулярні фонові завдання, такі як відправлення щотижневих електронних листів або генерація звітів опівночі.
"Gems name: sidekiq-scheduler, resque-scheduler, sidekiq-cron"
# 3.2 Ваш веб-додаток потребує безпечного управління завантаженням файлів, включаючи зображення та документи, і можливо зберігати їх у хмарному сервісі.
"Gems name: aws-sdk-s3, azure-storage-blob, google-cloud-storage"
# 3.3 Ваш веб-сайт містить розділ з великою кількістю статей, наприклад, блог або новинний портал. З часом кількість статей зросла до сотень або навіть тисяч, і відвідувачам сайту стає важко знайти потрібну інформацію. Вам потрібен ефективний спосіб організувати показ цих статей, щоб користувачі могли легко переглядати їх, не загрузнувши у великій кількості контенту на одній сторінці.
"Gem name: pagy"
